emacs/.emacs.gmacs/config.org
# -*- lexical-binding: t; -*-
#+title: Config
#+author: Gunnar Bastkowski
#+startup: content

* Basic Settings
** Authentication
Use unix pass as default source for authentication.
#+begin_src emacs-lisp
(cond ((eq system-type 'gnu/linux)
       (setenv "SSH_AUTH_SOCK" "/run/user/1000/gnupg/S.gpg-agent.ssh"))
      (t
       (setenv "SSH_AUTH_SOCK" "/Users/gunnar.bastkowski/.gnupg/S.gpg-agent.ssh")))

(setq auth-sources '(password-store))
#+end_src


* Perspectives
** Perspective Mode
#+begin_src emacs-lisp
(use-package persp-mode
  :config
  (persp-mode 1))
#+end_src
** Desktop
#+begin_src emacs-lisp
(desktop-save-mode 1)
#+end_src


* Package Management
** Automatic Package Updates
#+begin_src emacs-lisp :tangle no
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src

** Initialize Package Database
#+begin_src emacs-lisp
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents (package-refresh-contents))
#+end_src


* Appearance
** Font
#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "IosevkaNerdFont" :height 140)
(gmacs/load-config "ligatures.el")
#+end_src

** Indenting
#+begin_src emacs-lisp :tangle no
(use-package indent-bars
  :unless noninteractive
  :hook ((prog-mode text-mode conf-mode) . +indent-guides-init-maybe-h)
  :straight t)
#+end_src

** Minimap
#+begin_src emacs-lisp
(use-package minimap)
#+end_src

** Modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))
#+end_src

** Themes
#+begin_src emacs-lisp
  (setq custom-theme-directory (expand-file-name "themes/" user-emacs-directory))

  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	  doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'gunnar t)
    (use-package all-the-icons)
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src

** Line Numbering
#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)

(dolist (mode '(org-mode-hook
                shell-mode-hook
                term-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Rainbow Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Emojis
#+begin_src emacs-lisp
(use-package emojify
  :straight t
  :hook (doom-first-buffer . global-emojify-mode)
  :config
  (setq emojify-styles
        (delq
         nil (list (if (modulep! +ascii) 'ascii)
                   (if (modulep! +github) 'github)
                   (if (modulep! +unicode) 'unicode))))

  (emojify-set-emoji-styles emojify-styles))
#+end_src

** Org Mode
#+begin_src emacs-lisp
(add-hook 'org-mode-hook #'org-indent-mode)

(setq org-indent-indentation-per-level 2)
(setq org-edit-src-content-indentation 0)

(use-package org-superstar
  :straight t
  :hook (org-mode . org-superstar-mode)
  :config
  ;; Make leading stars truly invisible, by rendering them as spaces!
  (setq org-superstar-leading-bullet ?\s
        org-superstar-leading-fallback ?\s
	org-hide-leading-stars nil
	org-superstar-headline-bullets-list '("◉" "○" "⬥" "⬦" "▸" "▹")
	org-superstar-todo-bullet-alist
	'(("TODO" . 9744)
	  ("[ ]"  . 9744)
	  ("DONE" . 9745)
	  ("[X]"  . 9745))))

(use-package org-fancy-priorities ; priority icons
  :hook (org-mode . org-fancy-priorities-mode)
  :hook (org-agenda-mode . org-fancy-priorities-mode)
  :config (setq org-fancy-priorities-list '("⚑" "⬆" "■")))
#+end_src


* Keyboard
#+begin_src emacs-lisp
(use-package which-key
  :diminish which-key-mode
  :init (which-key-mode)
  :config (setq which-key-idle-delay 1))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src


* Completion
** Corfu
#+begin_src emacs-lisp
(use-package corfu
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.24)
  (corfu-auto-prefix 2)
  (corfu-cycle t)
  (corfu-count 16)
  (corfu-max-width 120)
  (corfu-on-exact-match nil)
  (corfu-popupinfo-mode t)
  (corfu-preselect 'prompt)
  (corfu-quit-at-boundary 'separator)
  (corfu-quit-no-match corfu-quit-at-boundary)
  (global-corfu-modes '((not erc-mode
			    circe-mode
			    help-mode
			    gud-mode
			    vterm-mode)
		       t))
  (tab-always-indent 'complete)
  :init
  (global-corfu-mode))

(use-package nerd-icons-corfu)

(use-package corfu-terminal)

(use-package yasnippet-capf)
#+end_src

This is the doom version:
#+begin_src emacs-lisp :tangle no
(use-package corfu
  :hook (doom-first-input . global-corfu-mode)
  :config
  (setq corfu-auto t
        corfu-auto-delay 0.24
        corfu-auto-prefix 2
        global-corfu-modes '((not erc-mode
                              circe-mode
                              help-mode
                              gud-mode
                              vterm-mode)
                             t)
        corfu-cycle t
        corfu-preselect 'prompt
        corfu-count 16
        corfu-max-width 120
        corfu-on-exact-match nil
        corfu-quit-at-boundary 'separator
        corfu-quit-no-match corfu-quit-at-boundary
        tab-always-indent 'complete)
  (add-to-list 'completion-category-overrides `(lsp-capf (styles ,@completion-styles)))
  (add-to-list 'corfu-auto-commands #'lispy-colon)
  (add-to-list 'corfu-continue-commands #'+corfu/move-to-minibuffer)
  (add-to-list 'corfu-continue-commands #'+corfu/smart-sep-toggle-escape)
  (add-hook 'evil-insert-state-exit-hook #'corfu-quit)
  (add-hook 'eshell-mode-hook (lambda () (setq-local corfu-auto nil) (corfu-mode)))

  ;; Respect `+corfu-want-minibuffer-completion'
  (defun +corfu-enable-in-minibuffer-p ()
    "Return non-nil if Corfu should be enabled in the minibuffer. See `+corfu-want-minibuffer-completion'."
    (not (or (bound-and-true-p mct--active)
	       (bound-and-true-p vertico--input)
			 (and (featurep 'auth-source)
			      (eq (current-local-map) read-passwd-map))
			 (and (featurep 'helm-core) (helm--alive-p))
			 (and (featurep 'ido) (ido-active))
			 (where-is-internal 'minibuffer-complete
					    (list (current-local-map)))
			   (memq #'ivy--queue-exhibit post-command-hook))))
  (setq global-corfu-minibuffer #'+corfu-enable-in-minibuffer-p)
  :init
  (global-corfu-mode))

(use-package nerd-icons-corfu)

(use-package corfu-terminal)

(use-package yasnippet-capf)
#+end_src

** Orderless
#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic)) ; Enable orderless matching
  (completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

** Vertico
#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :init
  (vertico-mode))

(use-package marginalia
  :ensure t
  :init
  (marginalia-mode))

;; (use-package vertico-directory
;;   :after vertico
;;   :bind (:map vertico-map
;;               ("RET" . vertico-directory-enter)
;;               ("DEL" . vertico-directory-delete-char)
;;               ("M-DEL" . vertico-directory-delete-word)))

(use-package consult
  :init
  (recentf-mode))

(use-package consult-dir)

(use-package consult-flycheck)

(use-package embark-consult)

(use-package embark)

(use-package wgrep)

(use-package nerd-icons-completion)

(use-package vertico-posframe)

(use-package consult-yasnippet)
#+end_src


* Languages
** Language Servers
#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration))
#+end_src

** TypeScript
#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.\s\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+end_src


* Presentations
#+begin_src emacs-lisp
(use-package command-log-mode)
#+end_src


* Keybindings
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (define-key org-src-mode-map (kbd "C-c C-c") #'org-edit-src-exit))
#+end_src
